Core/src/Reports/СравнитьДанные_Документа_И_RS/СравнитьДанные_Документа_И_RS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СравнитьДанные_Документа_И_RS</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатур</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>WAYBILL_NUMBER</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура_1С</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Код_1С</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество_1С</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма_1С</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС_1С</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>W_NAME</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BAR_CODE</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>QUANTITY</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNT</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AMOUNTVat</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Превязан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

Core/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СоответствияНоменклатуры/СоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоответствияНоменклатуры</name>
  <enumValues>
    <name>ПоШтрихкоду</name>
  </enumValues>
  <enumValues>
    <name>ПоАртикулу</name>
  </enumValues>
  <enumValues>
    <name>ПоКоду</name>
  </enumValues>
  <enumValues>
    <name>ПоХарактеристике</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходнаяНакладная</name>
  <enumValues>
    <name>ПродажаПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Reports/СравнитьДанные_Документа_И_RS/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбновитьОтчет(ДокументРезультат, ДанныеРасшифровки);
	
КонецПроцедуры

Процедура ОбновитьОтчет(ДокументРезультат, ДанныеРасшифровкиКомпоновки) 
	
	ДокументРезультат.Очистить();
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, НастройкиКомпоновкиДанных, ДанныеРасшифровкиКомпоновки);
	//МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос,"Проект = &П","ВЫБОР КОГДА Проект.ТипПроекта = ЗНАЧЕНИЕ(Перечисление.ТипПроекта.Проект) ТОГДА Проект ИНАЧЕ Проект.Проект КОНЕЦ = &П");

	
	НачалоПериода	= МакетКомпоновки.ЗначенияПараметров.Найти("НачалоПериода").Значение;
	КонецПериода	= МакетКомпоновки.ЗначенияПараметров.Найти("КонецПериода").Значение;
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщение 			= Новый СообщениеПользователю;
		Если НЕ ЗначениеЗаполнено(НачалоПериода) И НЕ ЗначениеЗаполнено(КонецПериода) Тогда
			Сообщение.Текст	 	= НСтр("ka='პერიოდის დაწყების და დასრული არ არის შევსებული!';ru='Дата начала и дату окончания не заполнена!';en='Start date and the end date is not filled!'");
		ИначеЕсли НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
			Сообщение.Текст	 	= НСтр("ka='პერიოდის დასაწყისი არ არის შევსებული!';ru='Дата начала не заполнена!';en='Start date is not filled!'");
		Иначе
			Сообщение.Текст	 	= НСтр("ka='პერიოდის დასასრული არ არის შევსებული!';ru='Начало периода не заполнена!';en='Beginning of the period is not full!'");
		КонецЕсли;
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли НачалоПериода > КонецПериода Тогда
		Сообщение 			= Новый СообщениеПользователю;
		Сообщение.Текст	 	= НСтр("ka='პერიოდის დაწყების თარიღი არ უნდა აღემატებოდეს დასრულების თარიღს!';ru='Дата начала периода не должна превышать дату окончания!';en='Date of commencement of the period must not exceed the expiry date!'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Период.ДатаНачала		= НачалоПериода;
	Период.ДатаОкончания	= КонецПериода;
		
	//ცხრილის გენერაცია_
	СписокНоменклатур.Очистить();
	Организация = Справочники.Организации.ОсновнаяОрганизация;
	ТоварыRS	= СписокНоменклатур.Выгрузить();
	ВсеОК		= ПолучитьВыданныеНакладные(ТоварыRS, "get_waybill_goods_list", Организация, Период);
	Если Не ВсеОК Тогда
		Возврат;
	КонецЕсли;
	ТоварыRS.Сортировать("WAYBILL_NUMBER, W_NAME");
	
	КлючВыгрузкиНоменклатурыВНалоговую = Организация.СоответствиеНоменклатур;
	Запрос = Новый Запрос;
	Если КлючВыгрузкиНоменклатурыВНалоговую = Перечисления.СоответствияНоменклатуры.ПоШтрихкоду Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
			|	РасходнаяНакладнаяЗапасы.Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Наименование КАК Наименование,
			|	СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество,
			|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Сумма,
			|	СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН КАК НомерТТН
			|ПОМЕСТИТЬ Запасы
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходнаяНакладнаяЗапасы.Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Ссылка,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Наименование
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Наименование,
			|	СУММА(ПриходнаяНакладнаяЗапасы.Количество),
			|	СУММА(ПриходнаяНакладнаяЗапасы.Всего),
			|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС),
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			|ГДЕ
			|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Наименование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Номенклатура,
			|	МАКСИМУМ(ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
			|ПОМЕСТИТЬ Штрихкоды
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Запасы.Номенклатура
			|			ИЗ
			|				Запасы КАК Запасы)
			|
			|СГРУППИРОВАТЬ ПО
			|	ШтрихкодыНоменклатуры.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Запасы.Документ КАК Документ,
			|	Запасы.НомерТТН КАК WAYBILL_NUMBER,
			|	Запасы.Номенклатура КАК Номенклатура_1С,
			|	Запасы.Количество КАК Количество_1С,
			|	Запасы.Сумма КАК Сумма_1С,
			|	Запасы.СуммаНДС КАК СуммаНДС_1С,
			|	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Код_1С
			|ИЗ
			|	Запасы КАК Запасы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Штрихкоды КАК Штрихкоды
			|		ПО Запасы.Номенклатура = Штрихкоды.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Запасы.Номенклатура.Наименование
			|ИТОГИ ПО
			|	WAYBILL_NUMBER";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяЗапасы.Ссылка КАК Документ,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН КАК WAYBILL_NUMBER,
			|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура_1С,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Код КАК Код_1С,
			|	СУММА(РасходнаяНакладнаяЗапасы.Количество) КАК Количество_1С,
			|	СУММА(РасходнаяНакладнаяЗапасы.Всего) КАК Сумма_1С,
			|	СУММА(РасходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС_1С
			|ИЗ
			|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
			|ГДЕ
			|	РасходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И РасходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю)
			|	И РасходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходнаяНакладнаяЗапасы.Номенклатура,
			|	РасходнаяНакладнаяЗапасы.Ссылка,
			|	РасходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	РасходнаяНакладнаяЗапасы.Номенклатура.Код
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Код,
			|	СУММА(ПриходнаяНакладнаяЗапасы.Количество),
			|	СУММА(ПриходнаяНакладнаяЗапасы.Всего),
			|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС)
			|ИЗ
			|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
			|ГДЕ
			|	ПриходнаяНакладнаяЗапасы.Ссылка.Проведен
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
			|	И ПриходнаяНакладнаяЗапасы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|
			|СГРУППИРОВАТЬ ПО
			|	ПриходнаяНакладнаяЗапасы.Номенклатура,
			|	ПриходнаяНакладнаяЗапасы.Ссылка,
			|	ПриходнаяНакладнаяЗапасы.Ссылка.НомерТТН,
			|	ПриходнаяНакладнаяЗапасы.Номенклатура.Код
			|ИТОГИ ПО
			|	WAYBILL_NUMBER";
		Если КлючВыгрузкиНоменклатурыВНалоговую = Перечисления.СоответствияНоменклатуры.ПоАртикулу Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасходнаяНакладнаяЗапасы.Номенклатура.Код", "РасходнаяНакладнаяЗапасы.Номенклатура.Артикул");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПриходнаяНакладнаяЗапасы.Номенклатура.Код", "ПриходнаяНакладнаяЗапасы.Номенклатура.Артикул");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецДня(Период.ДатаОкончания));
	
	РезультатЗапасов = Запрос.Выполнить();
	ВыборкаНомерТТН = РезультатЗапасов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНомерТТН.Следующий() Цикл
		НС_RS = ТоварыRS.НайтиСтроки(Новый Структура("WAYBILL_NUMBER", ВыборкаНомерТТН.WAYBILL_NUMBER));		
		Выборка = ВыборкаНомерТТН.Выбрать();
		ПревязанноеКоличество	= 0;
		КоличествоНаиденныхСтрок_RS 		= НС_RS.Количество();		
		Пока Выборка.Следующий() Цикл
			Если КоличествоНаиденныхСтрок_RS = 0 ИЛИ ПревязанноеКоличество = КоличествоНаиденныхСтрок_RS Тогда
				НоваяСтрокаНС_RS = ТоварыRS.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаНС_RS, Выборка);
			Иначе
				Для Каждого СтрокаНС_RS ИЗ НС_RS Цикл
					Если СтрокаНС_RS.Превязан Тогда
						Продолжить;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(СтрокаНС_RS, Выборка);
					СтрокаНС_RS.Превязан = Истина;
					ПревязанноеКоличество = ПревязанноеКоличество + 1;
					Прервать;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Если ПревязанноеКоличество < КоличествоНаиденныхСтрок_RS Тогда
			Для Инд = ПревязанноеКоличество По КоличествоНаиденныхСтрок_RS-1 Цикл
				НС_RS[Инд].Документ = НС_RS[0].Документ;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	КонечнаяТаблица = ТоварыRS.Скопировать();
	КонечнаяТаблица.Колонки.WAYBILL_NUMBER.Имя	= "НомерТТН";
	КонечнаяТаблица.Колонки.W_NAME.Имя			= "Номенклатура_RS";
	КонечнаяТаблица.Колонки.BAR_CODE.Имя		= "Код_RS";
	КонечнаяТаблица.Колонки.QUANTITY.Имя		= "Количество_RS";
	КонечнаяТаблица.Колонки.AMOUNT.Имя			= "Сумма_RS";
	КонечнаяТаблица.Колонки.AMOUNTVat.Имя		= "СуммаНДС_RS";
	//_ცხრილის გენერაცია
	
	
	//Создадим и инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("КонечнаяТаблица", КонечнаяТаблица), ДанныеРасшифровкиКомпоновки, Истина);//პარამეტრი 2 
	
	//Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	
	//Обозначим начало вывода
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецПроцедуры


&НаСервере
Функция ПолучитьВыданныеНакладные(ТабЗагрузки, SoapAction, Организация, Период) 
		
	ПараметрыРС = РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПолучитьСтруктуруПараметровWS(Организация);
	su 							= ПараметрыРС.ПользовательПодключения;
	sp 							= ПараметрыРС.ПарольПодключения;
	РежимовПротоколаДляОбменаRS = ПараметрыРС.РежимовПротоколаДляОбменаRS;
	
	SLLСоединение = РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПолучитьSLLСоединение();
	WSСоеденение  = Новый WSПрокси(РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПолучитьWSОпределение(РежимовПротоколаДляОбменаRS), "http://tempuri.org/", "WayBills", "WayBillsSoap", , , SLLСоединение);
	ТипXDTO		  = WSСоеденение.ФабрикаXDTO.Тип("http://tempuri.org/", SoapAction);
	
	парамXDTO	  = WSСоеденение.ФабрикаXDTO.Создать(ТипXDTO);
	парамXDTO.su 			= su;
	парамXDTO.sp 			= sp;
	парамXDTO.statuses		= ",1,2,";
	парамXDTO.itypes		= "2,3,5,6"; //1-გადაადგილება,4-დისტრიბუცია
	парамXDTO.begin_date_s	= Период.ДатаНачала;
	парамXDTO.begin_date_e	= Период.ДатаОкончания;
	
	Попытка 
		ДанныеРасходныхНакладных = WSСоеденение.get_waybill_goods_list(парамXDTO);
		WAYBILL_LIST = Новый ТаблицаЗначений;
		Если ТипЗнч(ДанныеРасходныхНакладных) = Тип("ОбъектXDTO") Тогда 
			WAYBILL_LIST = ДанныеРасходныхНакладных.get_waybill_goods_listResult.WAYBILL_LIST.WAYBILL;
			
			Если ТипЗнч(WAYBILL_LIST) = Тип("ОбъектXDTO") Тогда
				Колво = 1;
			ИначеЕсли ТипЗнч(WAYBILL_LIST) = Тип("СписокXDTO") Тогда
				Колво = WAYBILL_LIST.Количество();
			КонецЕсли;
		КонецЕсли;
		
		ТабЗагрузки.Очистить();
		Для инд = 0 По Колво - 1 Цикл
			нСтрока = ТабЗагрузки.Добавить();
			СТР_RS = WAYBILL_LIST[инд];
			ЗаполнитьЗначенияСвойств(нСтрока, СТР_RS);
			Если СТР_RS.VAT_TYPE = "0" Тогда
				нСтрока.AMOUNTVat = СТР_RS.AMOUNT * 18/118;
			КонецЕсли;
		КонецЦикла;
	Исключение
		Сообщить(НСтр("ka='საგადასახადო სამსახურის სერვერთან წვდომის შეცდომა';ru='Ошибка доступа к серверу налоговой службы';en='Error accessing the server Tax Service'"));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьSLLСоединение() Экспорт 
	
	SLL = Новый ЗащищенноеСоединениеOpenSSL(Новый СертификатКлиентаWindows(),Новый СертификатыУдостоверяющихЦентровWindows());
	Возврат SLL;
	
КонецФункции
&НаСервере
Функция ПолучитьWSОпределение(РежимПротокола = Неопределено) Экспорт 
	
	#Если Сервер Тогда
		Возврат Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
	#Иначе
		Если глОпределение = Неопределено Тогда
			глОпределение = Новый WSОпределения("http://services.rs.ge/WayBillService/WayBillService.asmx?wsdl", "");
		КонецЕсли;
		Возврат	глОпределение;
	#КонецЕсли
	
КонецФункции
